app/controllers/groups_controller.rb

  def create
    @group = Group.new(params[:group])
    @group.user = @current_user
    respond_to do |wants|
      if @group.save
---
INSERT INTO "groups" ("name", "created_at", "updated_at", "user_id") VALUES('teste1', '2010-10-06 15:34:07', '2010-10-06 15:34:07', 1)

  def index
    @groups = Group.all(:conditions => {:user_id => @current_user})
---
SELECT * FROM "groups" WHERE ("groups".user_id = 1)