app/controllers/phones_controller.rb

INSERT INTO "phones" ("created_at", "updated_at", "info", "user_id", "description") VALUES('2010-10-06 14:34:40', '2010-10-06 14:34:40', '55 (11) 9417-3205', 1, 'mobile')
---
  def create
    @phone = Phone.new(params[:phone])
    @phone.update_attributes(:user_id => @user.id)
    respond_to do |wants|
      if @phone.save

SELECT * FROM "phones" WHERE ("phones"."id" = '2') AND ("phones".user_id = 1) LIMIT 1
---
  def edit
    @phone = @user.phones.find_by_id(params[:id])

SELECT * FROM "phones" WHERE ("phones"."id" = '2') AND ("phones".user_id = 1) LIMIT 1
UPDATE "phones" SET "updated_at" = '2010-05-14 18:38:52', "number" = '76645125' WHERE "id" = 2
---
  def update
    @phone = @user.phones.find_by_id(params[:id])
    respond_to do |format|
      @phone.update_attributes(params[:phone])

SELECT * FROM "phones" WHERE ("phones"."id" = '2') AND ("phones".user_id = 1) LIMIT 1
---
  def find_phone
    @phone = Phone.find_by_id(params[:id]) if params[:id]